packages/django-jbank/django-jbank-3.8.6.tar.gz/django-jbank-3.8.6/logs/ws/00000025a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pkif="http://danskebank.dk/PKI/PKIFactoryService" xmlns:elem="http://danskebank.dk/PKI/PKIFactoryService/elements">
  <soapenv:Header/>
  <soapenv:Body>
    <pkif:CreateCertificateIn>
      <pkif:RequestHeader>
        <pkif:SenderId>6D3142</pkif:SenderId>
        <pkif:CustomerId>6D3142</pkif:CustomerId>
        <pkif:RequestId>25</pkif:RequestId>
        <pkif:Timestamp>2020-07-20T20:50:20.622352+03:00</pkif:Timestamp>
        <pkif:InterfaceVersion>1</pkif:InterfaceVersion>
        <pkif:Environment>customertest</pkif:Environment>
      </pkif:RequestHeader>
    <EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Element">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<EncryptedKey xmlns="http://www.w3.org/2001/04/xmlenc#">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<X509Data>
<X509Certificate>MIIFATCCAumgAwIBAgIFAQjv8bkwDQYJKoZIhvcNAQELBQAwgZgxEDAOBgNVBAMT
B0RCR1JPT1QxCzAJBgNVBAYTAkRLMRMwEQYDVQQHEwpDb3BlbmhhZ2VuMRAwDgYD
VQQIEwdEZW5tYXJrMRowGAYDVQQKExFEYW5za2UgQmFuayBHcm91cDEaMBgGA1UE
CxMRRGFuc2tlIEJhbmsgR3JvdXAxGDAWBgNVBAUTDzYxMTI2MjI4MTExMDAwMzAe
Fw0yMDAyMDQxMjAwMDBaFw0yMjAyMDQxMjAwMDBaMIGYMRAwDgYDVQQDEwdEUENS
WVBUMQswCQYDVQQGEwJESzETMBEGA1UEBxMKQ29wZW5oYWdlbjEQMA4GA1UECBMH
RGVubWFyazEaMBgGA1UEChMRRGFuc2tlIEJhbmsgR3JvdXAxGjAYBgNVBAsTEURh
bnNrZSBCYW5rIEdyb3VwMRgwFgYDVQQFEw82MTEyNjIyODQ5MTAwMDkwggEgMA0G
CSqGSIb3DQEBAQUAA4IBDQAwggEIAoIBAQCmSUzQYj0Fx3jwvkz0lhmyyXRKwo5T
hts+1xFrG7euQ6oIMUJJpr8tgKxwDxdxxK/RXaYCHRH9mpIoyxCPlS3reRF4BMB6
gL2KOINnRyC3jmJ7kYHyWdhYfMb5VPIvusqPXc91HdVJb6rxvVSrTy/dB+V1od2q
uHNxA+Luhno37CXU1STrVvSrgHzOm45MROryuOu0lWY+d49tWZN9ilNI2Rf8mJjT
ZVKwJu4v02jXLGAqWpXQX0vxa7nI1D0xkOqnTvd04iDOdDE+jRtiy3SF8508LRqQ
jRH+9TZbX++yFd9Z/AR2h6AwM8OsLSC1QMJG7KeJw8st7K9i8KEOdglpAgEDo1Iw
UDAfBgNVHSMEGDAWgBTrVX/FmGlwJqoQ3fgyj1cJ40A/OjAdBgNVHQ4EFgQUMowN
BX+7Vy5lfO+d+tCxZ+ZupdYwDgYDVR0PAQH/BAQDAgQwMA0GCSqGSIb3DQEBCwUA
A4ICAQA+TV7cAPm5mKIAzTfuS4x4/KAlysTXZ3o0F2fYZmylNnUafi0+T21utPAv
bBYVFpr9fRq+q0L75ZCqU4pDvRLpHF7Q0RZ01ra7otVS78saxc/YUql+MsnHxeUw
9F8FJx7234KlRkhmY8xB743T/LQcp3zCRYUd0Rn2Ocaq7YoYGnx8QALItmJcagsX
MwYVsvXtWHHaDGFpcaivLX3e8cVQ+nI7slq1EfJ5xEdtSZ/zcGv+Ve4S6D1HLQ/K
oTQMzematrVvwwJMuqLMQdA1Pdtau3niupB3Se7AUq0bEZYF04Zlo4sOE21K9gSt
lJ5tSq0ohli02uXuQ/ggsqZSIH4t9WirWOMpS4KFkub02AYaicbm6SUyVg+odEaj
cFz+TEqd9C7cGgBL6MkLxXGj0DX64z4yU9lMlqQ8CzuZi5cMfpxvHVm4E+etLnYf
fzZ6jPnf3RbVumxPaRqnz6vceijWtmESg6cBei+phPzMCjjrXP0xng3+Bzqdn/lY
e8znS54o+UWJcENwvGc6tsUtBYGJOe6srIJHrXQKTG3DN6oDN2U5zT4cUBFvlHjx
fdj14m0Y0+gE90iTUJknWVRyyNDhPbYG1YCHRItVUxpGIp9tsV5FRP5qVbiMC7ba
hEsDAxMvL29i1vJbnJPT9e4OPkhEN5IqVQbu0QeOKMYT/YMZZQ==</X509Certificate>
</X509Data>
</KeyInfo>
<CipherData>
<CipherValue>ED2Lq+7g1EAn45R9bAbc6FGIeNPiX9WCzwUMnFEBM5Lg4IHpe+awETgJunLFWaoT
BWS6/d7mv3WJYCR8IK5fmeRPMfMgZbSxLFSkBnMYF1+zZe9OMn77IAkNKi4oQMsZ
MplZnR6MrUowh28R+pk+2qA4pvgtfdqUWWKpyRMtT2ta1gda6p0qP269ZsVDih09
U2HSHAbWbHeFmv9MURG9wKQ92HGN/hHIOJ67zoUpM3nS7Qxw2MRWRl1JEafbCngL
+2IdEF4BEPKxseRrSJU+XbPEMo+J9PlRz649XRXYZYAzXB85mVp1MzJDO2e5+/EK
00jl7jIzUyhwvrU0T1ZGig==</CipherValue>
</CipherData>
</EncryptedKey>
</KeyInfo>
<CipherData>
<CipherValue>WCd+w29xEzCnCpO0C/QMF9UuOjPF6Xqa+LVdIcH2XRTEtrVuYeBB7rEIzYIyHFMm
VR9PhbwJNjxkUblM/YQwkwE0m9dYQ6Ow5k1orZtgm4FLPuXIqMg9gMCVOxvVW64W
MlzzTPCB+GPAf5Kckmpjrs+rNaT61x3Z4UZvhKaZQYvxxuGjfzKINGC89yZ0Chy5
w9UIST6g5S4J8jR8+yt9bdQ+4Woid5zt07UQvIZSiCTd9/oRHPO1htZRPF3E4SrT
yMmPD/1eRbwJm2wwtL6yEPNN59k6qPZHmfVeSkTeCXhzXWDWpMHSuGv/v81rADcf
gUyo2qUimJKylTWJOGPSEH269kOFx30NC4AxrKIZEP5TQ9fO0oNBv3i/Z6G8vTN1
xvGB3TUL54NZGq/hfv4RXRwEAjpjOI0oetV+3P5tu+U8Z6KaZWxMcqq7KGPJdlq8
nDuwyE7gfACZBdzra8/QPSRX23kvKRjQFiTIl8gPy0MuiskvzVybmKEjYokf5Mam
7jWQ3xglNfvuV9jbo8LDrecznxyomM3sGylSZ1GRjxILP/Ix7iXiLdf+jh2F35Lr
JDbNjx0d3P5rWjgFvh/Xn5ig9/ff/cVF1cHaPZguQh2RYGI3yquwRBD46REAFuk9
fVWpq4albfIY3lP0m/k/FB49qQMAGD9R0ge6aacIPgPeGM3ixFyeETikkoa8p5zF
Q1q9IgAMZ0qcXnkCImSe/afFl4ULAmImkQGTK3p1wyt9nyBWpfM/oZ3+0ct+0ZQX
qnT2eSyT8FSjsJ4VLpPFY0X34K38qnk+sY7yp5mSmYGOAb3ZWSn/RxNjxPsfRAKL
z0IBN6VBzGak+KeSsl5Jb4mmTq01FkCHyh2gE0B6YlgcW/OZv8LGtFFoKes9tUOl
1aeSyn40EXzawVSsOA4HxgV7j0IHuXyK15Dd6AwkwmFwMsJtW6U1E4GQwZkqR1Ut
1Zi7C9PtdQhQvSfh5TKWS124jhgrqEMCvBRdX2eR9zV1MAt6+uIW8OxgIk6wnxwb
UfSpZriuCgn3+Fmvytl34dETFomueEgyLDjSWOsypkktsTwTa8yk5Ox0MObULjKG
nnco5tyyrR0Hf4avMUBl6vnzYD8PmfsLUx2mv5z1VlEhkyHuSRoAs13EYsq6jhLg
7P6utPEqQx/FIn3THNaS+bbZpz6G2pZDoO0XZnBJic7HbWXbIz+MxjUxBPnrz8QF
irpqbBnXOdZ8HTnPqi5EsjS3zkpSUJAkuGUYFdZiRFsWC9e0ivK4cHrd8qZbCjam
zV2lQoDBxWW5eB9ISUjQ60syOPStpNeP89sWYVZ2Y9rI0WMb7VcpO90xZchcTyPJ
M/Kh7bW9aKTtp+GAr6pKdky4UN7jdcYvUvQ24Ys20YlqfEVl9DQUraXW+ILQcATT
SeR0K6unAyrRPnetrTGswYWk1RyMUd5d+ZMjKp6N8RHO1VQoqJjffh2qMDr32unl
5ss4p/1xVj9+Wzd4ekfzNYorfh4Cry11s896bfure8r8QOr8DtilCJgDYm2e8PiG
//Qt0QbNc9VMxD9lIG6gwrzjzUGEucHBhBRxrxaD24rmysuDoWaHoO6lfcvkUzGK
iAI6Hk8UQYoPU2+E3OTC3ru8vP2jZxOmCviU0fQw05lsIOs2tL3CufTrBTOTZ+Kg
7T8yml+StnBnOFyykfqzdcfYWIXviMABxCaoXPROgcSbNgZXQQtraZdn36GhQEck
2t2rZRqLxGulA28UR4j4ju0MsdNFptlr0KMd5lbxj4QkESEJmhJJcNNuM78VP9Tj
wNu5r34ixx5nnHDB3dQUXRstOdZXBByzqpYM0iJP/7pj+5UnsU7qASRHiewh4Bb8
7dXZ74j55JqX61qZlfUeGISFydEE+hpjg8HuXXzLfNPiQPUYJ4REoEEoCD3NEnL3
BLJ8DIRxJyDbaysodIa0h/sPABkGswaDjo9pz7U8GnmLE3+UrsC89e3bZBMUCx4z
nFVZtutzwdc3zkWyobrVY8mcSXo1KilKqveEwjI+2cYFZOLdOJ74+2NX80BY84wQ
LxL+fDPAfaZaFFpQz11Qm3itFx2DEu6WU6U8FQAzgh5lSI5kGwUktgNF7FLQVbA8
QTr6ZeG+8+JbW7VVt0LHiGHq7Ft9gKZlvXuuJv2+t/ut98caUdAP9K3SnCRNIepy
SmuPD8ziZ5NaPpOWU2M0b6tOjfVExedFgb5NdT51dpHuyMg/LA8FHhfKYvN0Bd53
D0UdTzl5n9g++1mvfWXwJT8O2yiqk9iRCS3Jjx24eyKC604BT5nnQWbj0d2pQ0sT
2f6LvpAT3BVRRTcfy0K0i/dRjEofSWCFMg8PpHjb0muNXRpFV2v6d5KfMvR+Tvw3
TxI+Y5i+Sfu5gptXj40MaIxrZmRuORuqcz+jm3C3d+DzavAXJ6aAojit0hNxpzag
R2gsWew5ut1foKhIIeBpv5uA5oaVJVI3NdbJ2iC4uNSII0ic5GyzmAfyXOhDTLwA
K1Xj3ZAEOEX/6B5YiTiPHbMApjc2fbkpic4h5runA0oOq5NaIPblKxBO46hg2XaH
FGwQJVw7Xwz0PcTKDYsElpgIMafggIQKBaN+Zxd+Q65HgfFABZ7G2GuVvYrvx+Vs
1VQH8cK60rMS7gSPLK4fUEOUiNPemFDF2lzrJmDUSXW3FZCMDfSTBxudIILH+Q8a
AA9+FgjEVVOLOMuHe5MSMZWfLnlWLbX8J8ORiKJAsJssk2gKLo8hbYEb3KNpwuI+
PzGkgjzBNITNwf6dWy53NSjkcDgLamDjk4SABipJQmC5HeQc5+ZY8K9K+LCN+Ry+
u8cimqQu3oWWf9ajvfUtl94BS2jsMbnBygv6IgSQveaZLP6t6Z5wr4W8jjG5gO4h
yifTzSFee7fAtF6sv9rfLlahu6axqidd0UfE/GPGBSNhM2Pk7tvzWDH+HDH+haHB
ytXW3HogUo9YrsXLxz+mZa8/ehxL84CPF4oSWkUIBDwk4vVhvWQB6AfOngcM3Frm
Fnct43jTN1Xv1t/RRVa1lFdSN9cJYt3pm4qjL+Clov4AT/Zyq9gXI9vpQZ0jg6dA
WQcZ4k+lZuyumj2+hmrH88riylMzu7/iOUH3t5/q+GkdVZFdxAU6iKF5wKF19H2t
ekAlPmNDqfq7xjP1aaqgs7RfaFFAQWu2Iot+NjEVDB+r227vh6xU91HoIPk6sLnf
LzlyA2uXxWT8vuBCwjNhCvLN2llqYrV37GF6KyBphcefMxN65q+561QBt2/xSQo5
YXANksqUGwQwsLspvdB7goPjKqK+JJ4Rj7+UcWh+Up8UORutCyEwIr0lcu/81J9G
hG/ABX3bsx7Mu4iAw5+5XphSlLHC1+5t+1j4WlRE8EAIbnXBRm3znj+SYs80Kw62
5Fy0dtgHfzjLNjnmWN3zs4eq63PTjw6V/Uhmnb01h5Hapvvfho60V0lwfH2Pjc9c
4Ij3CQ04ZXtGqRipzAwHXUwG0Sf7wiDfiQkIs6M7+PAnRJM0rUU6V4WiC1GccJMj
T6sqyrmoQYntiKFh0oxafbztaUHJgE59BAEboPFkvgw0KfdquiykhATZX9B+jtYQ
E7ofjlattF4+htjn7EaL0ZbPl5zKXSEvviJhh8mtrpkZzrjAAuA02R4Q6caDMdgi</CipherValue>
</CipherData>
</EncryptedData></pkif:CreateCertificateIn>
  </soapenv:Body>
</soapenv:Envelope>